# Big Data Real-Time Analytics with Python and Spark

## Data Manipulation in Python with Pandas

### Case Study 2

**Problem Definition and Data Source**

In this Case Study the objective is to carry out a detailed school data analysis process by crossing, comparing and summarizing different types of information.

In total, 25 business questions will be answered that will require analyzing the data from different perspectives. Pandas will be the only tool used.

For this work we will use fictitious data, but which could represent real data. The data was generated from the Realistic Data Generator, at the address below:

https://www.mockaroo.com

In [1]:
import pandas as pd

#### Carregando os Dados

In [2]:
schools_data = pd.read_csv("dataset/dataset_escolas.csv")

In [3]:
schools_data.shape

(15, 5)

In [4]:
schools_data.head()

   ID_Escola Nome_Escola Tipo_Escola  Numero_Alunos  Orcamento_Anual
0          0    Escola A     Publica           2917          1910635
1          1    Escola B     Publica           2949          1884411
2          2    Escola C  Particular           1761          1056600
3          3    Escola D     Publica           4635          3022020
4          4    Escola E  Particular           1468           917500

In [5]:
student_data = pd.read_csv("dataset/dataset_estudantes.csv")

In [6]:
student_data.shape

(39160, 7)

In [7]:
student_data.head()

,ID_Estudante,Nome_Estudante,Genero,Serie,Nome_Escola,Nota_Redacao,Nota_Matematica
0,0,Kevin Bradley,M,6,Escola A,66,79
1,1,Paul Smith,M,9,Escola A,94,61
2,2,John Rodriguez,M,9,Escola A,90,60
3,3,Oliver Scott,M,9,Escola A,67,58
4,4,William Ray,F,6,Escola A,97,84

In [8]:
full_data = pd.merge(student_data, schools_data, how = "left", on = ["Nome_Escola", "Nome_Escola"])

In [9]:
full_data.shape

(39160, 11)

In [10]:
full_data.head()

,ID_Estudante,Nome_Estudante,Genero,Serie,Nome_Escola,Nota_Redacao,Nota_Matematica,ID_Escola,Tipo_Escola,Numero_Alunos,Orcamento_Anual
0,0,Kevin Bradley,M,6,Escola A,66,79,0,Publica,2917,1910635
1,1,Paul Smith,M,9,Escola A,94,61,0,Publica,2917,1910635
2,2,John Rodriguez,M,9,Escola A,90,60,0,Publica,2917,1910635
3,3,Oliver Scott,M,9,Escola A,67,58,0,Publica,2917,1910635
4,4,William Ray,F,6,Escola A,97,84,0,Publica,2917,1910635

In [11]:
full_data["Serie"].unique()

array([6, 9, 8, 7], dtype=int64)

In [12]:
full_data["Genero"].unique()

array(['M', 'F'], dtype=object)

#### Data Analysis Challenge

Answer the questions below.

> **1- How many have data schools?**

In [13]:
total_schools = len(full_data["Nome_Escola"].unique())
total_schools

15

> **2- What is the total number of student records in the database?**

In [14]:
total_students = full_data["ID_Estudante"].count()
total_students

39160

> **3- What is the total budget considering all schools?**

In [15]:
total_budget = schools_data["Orcamento_Anual"].sum()
total_budget

24649428

> **4- What is the average grade of students in Writing?**

In [16]:
average_writing = full_data["Nota_Redacao"].mean()
average_writing

81.87574055158325

> **5- What is the average grade of students in Mathematics?**

In [17]:
average_math = full_data["Nota_Matematica"].mean()
average_math

78.98493360572012

> **6- Considering that the passing grade is 70, how many students passed Writing? (Deliver the result in absolute value and percentage)**

In [18]:
count_approved_writing = full_data[(full_data["Nota_Redacao"] >= 70)].count()["Nome_Estudante"]
count_approved_writing

33600

In [19]:
percentage_approved_writing = count_approved_writing / float(total_students) * 100
percentage_approved_writing

85.80183861082737

> **7- Considering that the passing score is 70, how many students passed Mathematics? (Deliver the result in absolute value and percentage)**

In [20]:
count_approved_math = full_data[(full_data["Nota_Matematica"] >= 70)].count()["Nome_Estudante"]
count_approved_math

29360

In [21]:
percentage_approved_math = count_approved_math / float(total_students) * 100
percentage_approved_math

74.97446373850867

> **8- Considering that the passing score is 70, how many students passed Mathematics and Writing? (Deliver the result in absolute value and percentage)**

In [22]:
total_count_approved = full_data[(full_data["Nota_Matematica"] >= 70)
                                                  & (full_data["Nota_Redacao"] >= 70)].count()["Nome_Estudante"]
total_count_approved

25518

In [23]:
total_percentage_approved = total_count_approved /  float(total_students) * 100
total_percentage_approved

65.16343207354444

> **9- Create a dataframe with the results of questions 1 to 8 that you calculated above. (Tip: create a dictionary and then convert it to a Pandas dataframe)**

In [24]:
school_performance_df = pd.DataFrame({"Total Schools": [total_schools],
                                       "Total Students": [total_students],
                                       "Total Budget": [total_budget],
                                       "Average Grade in Writing": [average_writing],
                                       "Average Grade in Mathematics": [average_math],
                                       "% Approval Writing": [percentage_approved_writing],
                                       "% Mathematics Approval": [percentage_approved_math],
                                       "% Total Approval": [total_percentage_approved]})

In [25]:
school_performance_df

,Total Schools,Total Students,Total Budget,Average Grade in Writing,Average Grade in Mathematics,% Approval Writing,% Mathematics Approval,% Total Approval
0,15,39160,24649428,81.875741,78.984934,85.801839,74.974464,65.163432

In [26]:
type(school_performance_df)

pandas.core.frame.DataFrame

> **10- Format the "Total Students" and "Total Budget" columns by adjusting the decimal places.**

In [27]:
school_performance_df["Total Students"] = school_performance_df["Total Students"].map("{:,}".format)
school_performance_df["Total Budget"] = school_performance_df["Total Budget"].map("${:,.2f}".format)

In [28]:
school_performance_df

,Total Schools,Total Students,Total Budget,Average Grade in Writing,Average Grade in Mathematics,% Approval Writing,% Mathematics Approval,% Total Approval
0,15,"39,160","$24,649,428.00",81.875741,78.984934,85.801839,74.974464,65.163432

#### Data Analysis with Pandas

> **1- Among the students approved in Writing, which genre received the highest number of approvals?**

In [29]:
approved_by_writing_genre = full_data[(full_data["Nota_Redacao"] >= 70)]["Genero"].value_counts()
approved_by_writing_genre

Genero
F    17027
M    16573
Name: count, dtype: int64

> **2- Among the students approved in Mathematics, which gender obtained the highest number of passes?**

In [30]:
approved_by_math_genre = full_data[(full_data["Nota_Matematica"] >= 70)]["Genero"].value_counts()
approved_by_math_genre

Genero
F    14835
M    14525
Name: count, dtype: int64

> **3- What are the types of all the schools in our database?**

In [31]:
schools_data["Tipo_Escola"].value_counts()

Tipo_Escola
Particular    8
Publica       7
Name: count, dtype: int64

In [32]:
types_of_schools = schools_data.set_index(["Nome_Escola"])["Tipo_Escola"].sort_values()
types_of_schools

Nome_Escola
Escola C    Particular
Escola E    Particular
Escola F    Particular
Escola G    Particular
Escola I    Particular
Escola J    Particular
Escola K    Particular
Escola O    Particular
Escola A       Publica
Escola B       Publica
Escola D       Publica
Escola H       Publica
Escola L       Publica
Escola M       Publica
Escola N       Publica
Name: Tipo_Escola, dtype: object

> **4- What is the total number of students per school?**

In [33]:
total_students_school = full_data["Nome_Escola"].value_counts().sort_values()
total_students_school

Nome_Escola
Escola I     427
Escola J     962
Escola E    1468
Escola O    1625
Escola C    1761
Escola K    1800
Escola G    1858
Escola F    2283
Escola N    2739
Escola A    2917
Escola B    2949
Escola L    3999
Escola D    4635
Escola M    4761
Escola H    4976
Name: count, dtype: int64

> **5- What is the total budget of each school per capita (per student)?**

In [34]:
school_budget = full_data.groupby(["Nome_Escola"])["Orcamento_Anual"].agg('mean').sort_values()
school_budget

Nome_Escola
Escola I     248087.0
Escola J     585858.0
Escola E     917500.0
Escola O    1043130.0
Escola K    1049400.0
Escola C    1056600.0
Escola G    1081356.0
Escola F    1319574.0
Escola N    1763916.0
Escola B    1884411.0
Escola A    1910635.0
Escola L    2547363.0
Escola D    3022020.0
Escola M    3094650.0
Escola H    3124928.0
Name: Orcamento_Anual, dtype: float64

In [35]:
school_budget_percapita = (school_budget / total_students_school).sort_values()
school_budget_percapita

Nome_Escola
Escola F    578.000000
Escola I    581.000000
Escola G    582.000000
Escola K    583.000000
Escola C    600.000000
Escola J    609.000000
Escola E    625.000000
Escola H    628.000000
Escola L    637.000000
Escola B    639.000000
Escola O    641.926154
Escola N    644.000000
Escola M    650.000000
Escola D    652.000000
Escola A    655.000000
dtype: float64

In [36]:
full_data.columns

Index(['ID_Estudante', 'Nome_Estudante', 'Genero', 'Serie', 'Nome_Escola',
       'Nota_Redacao', 'Nota_Matematica', 'ID_Escola', 'Tipo_Escola',
       'Numero_Alunos', 'Orcamento_Anual'],
      dtype='object')

> **6- What is the average grade of students in Writing for each school?**

In [37]:
average_school_writing = full_data.groupby(["Nome_Escola"])["Nota_Redacao"].agg('mean').sort_values()
average_school_writing

Nome_Escola
Escola L    80.744686
Escola N    80.746258
Escola D    80.934412
Escola M    80.966394
Escola H    81.033963
Escola B    81.158020
Escola A    81.182722
Escola C    83.725724
Escola O    83.810462
Escola I    83.814988
Escola E    83.816757
Escola K    83.955000
Escola G    83.975780
Escola F    83.989488
Escola J    84.044699
Name: Nota_Redacao, dtype: float64

> **7- What is the average grade of students in Mathematics for each school?**

In [38]:
average_school_math = full_data.groupby(["Nome_Escola"])["Nota_Matematica"].agg('mean').sort_values()
average_school_math

Nome_Escola
Escola A    76.629414
Escola B    76.711767
Escola L    76.842711
Escola H    77.048432
Escola M    77.072464
Escola N    77.102592
Escola D    77.289752
Escola G    83.061895
Escola F    83.274201
Escola E    83.351499
Escola C    83.359455
Escola O    83.435077
Escola K    83.682222
Escola I    83.803279
Escola J    83.839917
Name: Nota_Matematica, dtype: float64

In [39]:
full_data.columns

Index(['ID_Estudante', 'Nome_Estudante', 'Genero', 'Serie', 'Nome_Escola',
       'Nota_Redacao', 'Nota_Matematica', 'ID_Escola', 'Tipo_Escola',
       'Numero_Alunos', 'Orcamento_Anual'],
      dtype='object')

> **8- Considering only students approved in Writing, what is the average number of students approved per school?**

In [40]:
approved_writing = full_data[(full_data["Nota_Redacao"] >= 70)]
approved_writing.head()

,ID_Estudante,Nome_Estudante,Genero,Serie,Nome_Escola,Nota_Redacao,Nota_Matematica,ID_Escola,Tipo_Escola,Numero_Alunos,Orcamento_Anual
1,1,Paul Smith,M,9,Escola A,94,61,0,Publica,2917,1910635
2,2,John Rodriguez,M,9,Escola A,90,60,0,Publica,2917,1910635
4,4,William Ray,F,6,Escola A,97,84,0,Publica,2917,1910635
5,5,James Miranda,M,6,Escola A,94,94,0,Publica,2917,1910635
6,6,Benjamin Carter,F,8,Escola A,82,80,0,Publica,2917,1910635

In [41]:
average_approved_writing_school = (approved_writing.groupby(["Nome_Escola"]).count()["Nome_Estudante"] / total_students_school * 100).sort_values()
average_approved_writing_school

Nome_Escola
Escola N    79.299014
Escola L    80.220055
Escola B    80.739234
Escola D    80.862999
Escola M    81.222432
Escola A    81.316421
Escola H    81.933280
Escola C    95.854628
Escola J    95.945946
Escola I    96.252927
Escola F    96.539641
Escola K    96.611111
Escola G    97.039828
Escola E    97.138965
Escola O    97.292308
dtype: float64

> **9- Considerando somente os alunos aprovados em Matemática, qual a média de alunos aprovados por escola?**

In [42]:
approved_math = full_data[(full_data["Nota_Matematica"] >= 70)]
approved_math.head()

,ID_Estudante,Nome_Estudante,Genero,Serie,Nome_Escola,Nota_Redacao,Nota_Matematica,ID_Escola,Tipo_Escola,Numero_Alunos,Orcamento_Anual
0,0,Kevin Bradley,M,6,Escola A,66,79,0,Publica,2917,1910635
4,4,William Ray,F,6,Escola A,97,84,0,Publica,2917,1910635
5,5,James Miranda,M,6,Escola A,94,94,0,Publica,2917,1910635
6,6,Benjamin Carter,F,8,Escola A,82,80,0,Publica,2917,1910635
8,8,Ethan Roth,M,7,Escola A,95,87,0,Publica,2917,1910635

In [43]:
average_approved_math_school = (approved_math.groupby(["Nome_Escola"]).count()["Nome_Estudante"] / total_students_school * 100).sort_values()
average_approved_math_school

Nome_Escola
Escola A    65.683922
Escola B    65.988471
Escola M    66.057551
Escola L    66.366592
Escola H    66.680064
Escola D    66.752967
Escola N    68.309602
Escola I    92.505855
Escola O    93.230769
Escola K    93.333333
Escola E    93.392371
Escola C    93.867121
Escola F    93.867718
Escola G    94.133477
Escola J    94.594595
dtype: float64

> **10- Considering students approved in Mathematics and Writing, what was the average number of students approved per school?**

In [44]:
approved_math_writing = full_data[(full_data["Nota_Redacao"] >= 70) & (full_data["Nota_Matematica"] >= 70)]
approved_math_writing.head()

,ID_Estudante,Nome_Estudante,Genero,Serie,Nome_Escola,Nota_Redacao,Nota_Matematica,ID_Escola,Tipo_Escola,Numero_Alunos,Orcamento_Anual
4,4,William Ray,F,6,Escola A,97,84,0,Publica,2917,1910635
5,5,James Miranda,M,6,Escola A,94,94,0,Publica,2917,1910635
6,6,Benjamin Carter,F,8,Escola A,82,80,0,Publica,2917,1910635
8,8,Ethan Roth,M,7,Escola A,95,87,0,Publica,2917,1910635
9,9,Jacob Greene,M,7,Escola A,96,84,0,Publica,2917,1910635

In [45]:
approved_rate_math_writing = (approved_math_writing.groupby(["Nome_Escola"]).count()["Nome_Estudante"] / total_students_school * 100).sort_values()
approved_rate_math_writing

Nome_Escola
Escola L    52.988247
Escola B    53.204476
Escola A    53.513884
Escola D    53.527508
Escola M    53.539172
Escola N    54.289887
Escola H    54.642283
Escola I    89.227166
Escola C    89.892107
Escola K    90.333333
Escola J    90.540541
Escola F    90.582567
Escola E    90.599455
Escola O    90.892308
Escola G    91.334769
dtype: float64

Let's build a summary dataframe with the previous metrics.

In [46]:
school_performance_summary_df = pd.DataFrame({"School Type": types_of_schools,
                                              "Total Students": total_students_school,
                                              "Total Budget": school_budget,
                                              "Budget Per Student": school_budget_percapita,
                                              "Average Grade Approval Writing": average_school_writing,
                                              "Average Mathematics Approval Grade": average_school_math,
                                              "% Approved Writing": average_approved_writing_school,
                                              "% Approved Mathematics": average_approved_math_school,
                                              "% General Approved": approved_rate_math_writing})

In [47]:
school_performance_summary_df

,School Type,Total Students,Total Budget,Budget Per Student,Average Grade Approval Writing,Average Mathematics Approval Grade,% Approved Writing,% Approved Mathematics,% General Approved
Nome_Escola,,,,,,,,,
Escola A,Publica,2917,1910635.0,655.000000,81.182722,76.629414,81.316421,65.683922,53.513884
Escola B,Publica,2949,1884411.0,639.000000,81.158020,76.711767,80.739234,65.988471,53.204476
Escola C,Particular,1761,1056600.0,600.000000,83.725724,83.359455,95.854628,93.867121,89.892107
Escola D,Publica,4635,3022020.0,652.000000,80.934412,77.289752,80.862999,66.752967,53.527508
Escola E,Particular,1468,917500.0,625.000000,83.816757,83.351499,97.138965,93.392371,90.599455
Escola F,Particular,2283,1319574.0,578.000000,83.989488,83.274201,96.539641,93.867718,90.582567
Escola G,Particular,1858,1081356.0,582.000000,83.975780,83.061895,97.039828,94.133477,91.334769
Escola H,Publica,4976,3124928.0,628.000000,81.033963,77.048432,81.933280,66.680064,54.642283
Escola I,Particular,427,248087.0,581.000000,83.814988,83.803279,96.252927,92.505855,89.227166
Escola J,Particular,962,585858.0,609.000000,84.044699,83.839917,95.945946,94.594595,90.540541
Escola K,Particular,1800,1049400.0,583.000000,83.955000,83.682222,96.611111,93.333333,90.333333
Escola L,Publica,3999,2547363.0,637.000000,80.744686,76.842711,80.220055,66.366592,52.988247
Escola M,Publica,4761,3094650.0,650.000000,80.966394,77.072464,81.222432,66.057551,53.539172
Escola N,Publica,2739,1763916.0,644.000000,80.746258,77.102592,79.299014,68.309602,54.289887
Escola O,Particular,1625,1043130.0,641.926154,83.810462,83.435077,97.292308,93.230769,90.892308

In [48]:
school_performance_summary_df["Total Budget"] = school_performance_summary_df["Total Budget"].map("${:,.2f}".format)
school_performance_summary_df["Budget Per Student"] = school_performance_summary_df["Budget Per Student"].map("${:,.2f}".format)

In [49]:
school_performance_summary_df

,School Type,Total Students,Total Budget,Budget Per Student,Average Grade Approval Writing,Average Mathematics Approval Grade,% Approved Writing,% Approved Mathematics,% General Approved
Nome_Escola,,,,,,,,,
Escola A,Publica,2917,"$1,910,635.00",$655.00,81.182722,76.629414,81.316421,65.683922,53.513884
Escola B,Publica,2949,"$1,884,411.00",$639.00,81.158020,76.711767,80.739234,65.988471,53.204476
Escola C,Particular,1761,"$1,056,600.00",$600.00,83.725724,83.359455,95.854628,93.867121,89.892107
Escola D,Publica,4635,"$3,022,020.00",$652.00,80.934412,77.289752,80.862999,66.752967,53.527508
Escola E,Particular,1468,"$917,500.00",$625.00,83.816757,83.351499,97.138965,93.392371,90.599455
Escola F,Particular,2283,"$1,319,574.00",$578.00,83.989488,83.274201,96.539641,93.867718,90.582567
Escola G,Particular,1858,"$1,081,356.00",$582.00,83.975780,83.061895,97.039828,94.133477,91.334769
Escola H,Publica,4976,"$3,124,928.00",$628.00,81.033963,77.048432,81.933280,66.680064,54.642283
Escola I,Particular,427,"$248,087.00",$581.00,83.814988,83.803279,96.252927,92.505855,89.227166
Escola J,Particular,962,"$585,858.00",$609.00,84.044699,83.839917,95.945946,94.594595,90.540541
Escola K,Particular,1800,"$1,049,400.00",$583.00,83.955000,83.682222,96.611111,93.333333,90.333333
Escola L,Publica,3999,"$2,547,363.00",$637.00,80.744686,76.842711,80.220055,66.366592,52.988247
Escola M,Publica,4761,"$3,094,650.00",$650.00,80.966394,77.072464,81.222432,66.057551,53.539172
Escola N,Publica,2739,"$1,763,916.00",$644.00,80.746258,77.102592,79.299014,68.309602,54.289887
Escola O,Particular,1625,"$1,043,130.00",$641.93,83.810462,83.435077,97.292308,93.230769,90.892308

In [50]:
school_performance_summary_df.describe()

,Total Students,Average Grade Approval Writing,Average Mathematics Approval Grade,% Approved Writing,% Approved Mathematics,% General Approved
count,15.000000,15.000000,15.000000,15.000000,15.000000,15.000000
mean,2610.666667,82.526623,80.433645,89.217919,80.984294,73.273847
std,1421.408339,1.516973,3.375608,8.179495,13.996232,18.988451
min,427.000000,80.744686,76.629414,79.299014,65.683922,52.988247
25%,1693.000000,81.000178,77.060448,81.042716,66.523328,53.533340
50%,2283.000000,83.725724,83.061895,95.854628,92.505855,89.227166
75%,3474.000000,83.885879,83.397266,96.575376,93.629746,90.561554
max,4976.000000,84.044699,83.839917,97.292308,94.594595,91.334769

> **11-A- Considering the general approval rate, which are the 5 schools with the best performance?**

In [51]:
top_schools = school_performance_summary_df.sort_values(["% General Approved"], ascending = False)
top_schools.head(5)

,School Type,Total Students,Total Budget,Budget Per Student,Average Grade Approval Writing,Average Mathematics Approval Grade,% Approved Writing,% Approved Mathematics,% General Approved
Nome_Escola,,,,,,,,,
Escola G,Particular,1858,"$1,081,356.00",$582.00,83.975780,83.061895,97.039828,94.133477,91.334769
Escola O,Particular,1625,"$1,043,130.00",$641.93,83.810462,83.435077,97.292308,93.230769,90.892308
Escola E,Particular,1468,"$917,500.00",$625.00,83.816757,83.351499,97.138965,93.392371,90.599455
Escola F,Particular,2283,"$1,319,574.00",$578.00,83.989488,83.274201,96.539641,93.867718,90.582567
Escola J,Particular,962,"$585,858.00",$609.00,84.044699,83.839917,95.945946,94.594595,90.540541

> **11-B- Considering the general approval rate, which are the 5 schools with the worst performance?**

In [52]:
bottom_schools = school_performance_summary_df.sort_values(["% General Approved"], ascending = True)
bottom_schools.head(5)

,School Type,Total Students,Total Budget,Budget Per Student,Average Grade Approval Writing,Average Mathematics Approval Grade,% Approved Writing,% Approved Mathematics,% General Approved
Nome_Escola,,,,,,,,,
Escola L,Publica,3999,"$2,547,363.00",$637.00,80.744686,76.842711,80.220055,66.366592,52.988247
Escola B,Publica,2949,"$1,884,411.00",$639.00,81.158020,76.711767,80.739234,65.988471,53.204476
Escola A,Publica,2917,"$1,910,635.00",$655.00,81.182722,76.629414,81.316421,65.683922,53.513884
Escola D,Publica,4635,"$3,022,020.00",$652.00,80.934412,77.289752,80.862999,66.752967,53.527508
Escola M,Publica,4761,"$3,094,650.00",$650.00,80.966394,77.072464,81.222432,66.057551,53.539172

In [53]:
full_data.columns

Index(['ID_Estudante', 'Nome_Estudante', 'Genero', 'Serie', 'Nome_Escola',
       'Nota_Redacao', 'Nota_Matematica', 'ID_Escola', 'Tipo_Escola',
       'Numero_Alunos', 'Orcamento_Anual'],
      dtype='object')

> **12- In each grade, which school had the students with the best performance in Mathematics?**

In [54]:
sixth_grade = full_data[(full_data["Serie"] == 6)]
seventh_grade = full_data[(full_data["Serie"] == 7)]
octave_grade = full_data[(full_data["Serie"] == 8)]
ninth_grade = full_data[(full_data["Serie"] == 9)]

In [55]:
sixth_grade.head()

,ID_Estudante,Nome_Estudante,Genero,Serie,Nome_Escola,Nota_Redacao,Nota_Matematica,ID_Escola,Tipo_Escola,Numero_Alunos,Orcamento_Anual
0,0,Kevin Bradley,M,6,Escola A,66,79,0,Publica,2917,1910635
4,4,William Ray,F,6,Escola A,97,84,0,Publica,2917,1910635
5,5,James Miranda,M,6,Escola A,94,94,0,Publica,2917,1910635
12,12,Sebastian Walker,F,6,Escola A,64,79,0,Publica,2917,1910635
13,13,Mateo Long,M,6,Escola A,71,79,0,Publica,2917,1910635

In [56]:
sixth_grade_notes = sixth_grade.groupby(["Nome_Escola"])["Nota_Matematica"].agg('mean')
seventh_grade_notes = seventh_grade.groupby(["Nome_Escola"])["Nota_Matematica"].agg('mean')
octave_grade_notes = octave_grade.groupby(["Nome_Escola"])["Nota_Matematica"].agg('mean')
ninth_grade_notes = ninth_grade.groupby(["Nome_Escola"])["Nota_Matematica"].agg('mean')

In [57]:
grades_per_series = pd.DataFrame({"Sixth Grade": sixth_grade_notes,
                                "Seventh Grade": seventh_grade_notes,
                                "Octave Grade": octave_grade_notes,
                                "Ninth Grade": ninth_grade_notes})

In [58]:
grades_per_series.sort_values(by = "Nome_Escola")

             Sixth Grade  Seventh Grade  Octave Grade  Ninth Grade
Nome_Escola
Escola A       77.027251      75.908735     76.446602    77.225641
Escola B       76.403037      76.539974     76.884344    77.151369
Escola C       83.420755      82.917411     83.383495    83.778976
Escola D       77.438495      77.337408     77.136029    77.186567
Escola E       82.044010      84.229064     83.842105    83.356164
Escola F       83.085578      83.724422     83.195326    83.035794
Escola G       83.094697      83.154506     82.765560    83.277487
Escola H       77.083676      76.996772     77.515588    76.492218
Escola I       83.787402      83.429825     85.000000    82.855422
Escola J       83.625455      83.372000     84.328125    84.121547
Escola K       83.264706      84.010288     83.836782    83.644986
Escola L       76.859966      76.612500     76.395626    77.690748
Escola M       77.187857      76.691117     77.491653    76.863248
Escola N       77.361345      77.672316     76.918058    76.179963
Escola O       83.605664      83.100478     83.533981    83.497024

In [59]:
grades_per_series["Sixth Grade"].idxmax()

'Escola I'

In [60]:
grades_per_series["Seventh Grade"].idxmax()

'Escola E'

In [61]:
grades_per_series["Octave Grade"].idxmax()

'Escola I'

In [62]:
grades_per_series["Ninth Grade"].idxmax()

'Escola J'

> **13- Considering the spending ranges per student as: [0, 585, 630, 645, 680], which range results in students with better performance?**

In [63]:
school_performance_summary_df.columns

Index(['School Type', 'Total Students', 'Total Budget', 'Budget Per Student',
       'Average Grade Approval Writing', 'Average Mathematics Approval Grade',
       '% Approved Writing', '% Approved Mathematics', '% General Approved'],
      dtype='object')

In [64]:
tracks_bins = [0, 585, 630, 645, 680]
labels_tracks = ["<$585", "$585-630", "$630-645", "$645-680"]

In [65]:
school_performance_summary_df["Spending Range Per Student"] = pd.cut(school_budget_percapita,
                                                                        tracks_bins,
                                                                        labels = labels_tracks,
                                                                        right = False)

In [66]:
school_performance_summary_df

,School Type,Total Students,Total Budget,Budget Per Student,Average Grade Approval Writing,Average Mathematics Approval Grade,% Approved Writing,% Approved Mathematics,% General Approved,Spending Range Per Student
Nome_Escola,,,,,,,,,,
Escola A,Publica,2917,"$1,910,635.00",$655.00,81.182722,76.629414,81.316421,65.683922,53.513884,$645-680
Escola B,Publica,2949,"$1,884,411.00",$639.00,81.158020,76.711767,80.739234,65.988471,53.204476,$630-645
Escola C,Particular,1761,"$1,056,600.00",$600.00,83.725724,83.359455,95.854628,93.867121,89.892107,$585-630
Escola D,Publica,4635,"$3,022,020.00",$652.00,80.934412,77.289752,80.862999,66.752967,53.527508,$645-680
Escola E,Particular,1468,"$917,500.00",$625.00,83.816757,83.351499,97.138965,93.392371,90.599455,$585-630
Escola F,Particular,2283,"$1,319,574.00",$578.00,83.989488,83.274201,96.539641,93.867718,90.582567,<$585
Escola G,Particular,1858,"$1,081,356.00",$582.00,83.975780,83.061895,97.039828,94.133477,91.334769,<$585
Escola H,Publica,4976,"$3,124,928.00",$628.00,81.033963,77.048432,81.933280,66.680064,54.642283,$585-630
Escola I,Particular,427,"$248,087.00",$581.00,83.814988,83.803279,96.252927,92.505855,89.227166,<$585
Escola J,Particular,962,"$585,858.00",$609.00,84.044699,83.839917,95.945946,94.594595,90.540541,$585-630
Escola K,Particular,1800,"$1,049,400.00",$583.00,83.955000,83.682222,96.611111,93.333333,90.333333,<$585
Escola L,Publica,3999,"$2,547,363.00",$637.00,80.744686,76.842711,80.220055,66.366592,52.988247,$630-645
Escola M,Publica,4761,"$3,094,650.00",$650.00,80.966394,77.072464,81.222432,66.057551,53.539172,$645-680
Escola N,Publica,2739,"$1,763,916.00",$644.00,80.746258,77.102592,79.299014,68.309602,54.289887,$630-645
Escola O,Particular,1625,"$1,043,130.00",$641.93,83.810462,83.435077,97.292308,93.230769,90.892308,$630-645

In [67]:
school_performance_summary_df.columns

Index(['School Type', 'Total Students', 'Total Budget', 'Budget Per Student',
       'Average Grade Approval Writing', 'Average Mathematics Approval Grade',
       '% Approved Writing', '% Approved Mathematics', '% General Approved',
       'Spending Range Per Student'],
      dtype='object')

In [68]:
df_13_1 = school_performance_summary_df.groupby(["Spending Range Per Student"])["Average Grade Approval Writing"].agg('mean')
df_13_2 = school_performance_summary_df.groupby(["Spending Range Per Student"])["Average Mathematics Approval Grade"].agg('mean')
df_13_3 = school_performance_summary_df.groupby(["Spending Range Per Student"])["% Approved Writing"].agg('mean')
df_13_4 = school_performance_summary_df.groupby(["Spending Range Per Student"])["% Approved Mathematics"].agg('mean')
df_13_5 = school_performance_summary_df.groupby(["Spending Range Per Student"])["% General Approved"].agg('mean')

In [69]:
performance_expenses_df = pd.DataFrame({"Average Writing" : df_13_1.round(2),
                                      "Average Mathematics": df_13_2.round(2),
                                      "% Approved Writing": df_13_3.round(2),
                                      "% Approved Mathematics": df_13_4.round(2),
                                      "% General Approved": df_13_5.round(2)})

In [70]:
performance_expenses_df

,Average Writing,Average Mathematics,% Approved Writing,% Approved Mathematics,% General Approved
Spending Range Per Student,,,,,
<$585,83.93,83.46,96.61,93.46,90.37
$585-630,83.16,81.90,92.72,87.13,81.42
$630-645,81.61,78.52,84.39,73.47,62.84
$645-680,81.03,77.00,81.13,66.16,53.53

> **14- Considering the size ranges (number of students) of schools as being: [0, 1000, 2000, 5000], which range results in students with better performance?**

In [71]:
school_performance_summary_df.columns

Index(['School Type', 'Total Students', 'Total Budget', 'Budget Per Student',
       'Average Grade Approval Writing', 'Average Mathematics Approval Grade',
       '% Approved Writing', '% Approved Mathematics', '% General Approved',
       'Spending Range Per Student'],
      dtype='object')

In [72]:
size_bins = [0, 1000, 2000, 5000]
labels_sizes = ["Small Size (<1000)", "Midsize (1000-2000)", "Large (2000-5000)"]

In [73]:
school_performance_summary_df["School Size"] = pd.cut(school_performance_summary_df["Total Students"],
                                                         size_bins,
                                                         labels = labels_sizes,
                                                         right = False)

In [74]:
school_performance_summary_df

,School Type,Total Students,Total Budget,Budget Per Student,Average Grade Approval Writing,Average Mathematics Approval Grade,% Approved Writing,% Approved Mathematics,% General Approved,Spending Range Per Student,School Size
Nome_Escola,,,,,,,,,,,
Escola A,Publica,2917,"$1,910,635.00",$655.00,81.182722,76.629414,81.316421,65.683922,53.513884,$645-680,Large (2000-5000)
Escola B,Publica,2949,"$1,884,411.00",$639.00,81.158020,76.711767,80.739234,65.988471,53.204476,$630-645,Large (2000-5000)
Escola C,Particular,1761,"$1,056,600.00",$600.00,83.725724,83.359455,95.854628,93.867121,89.892107,$585-630,Midsize (1000-2000)
Escola D,Publica,4635,"$3,022,020.00",$652.00,80.934412,77.289752,80.862999,66.752967,53.527508,$645-680,Large (2000-5000)
Escola E,Particular,1468,"$917,500.00",$625.00,83.816757,83.351499,97.138965,93.392371,90.599455,$585-630,Midsize (1000-2000)
Escola F,Particular,2283,"$1,319,574.00",$578.00,83.989488,83.274201,96.539641,93.867718,90.582567,<$585,Large (2000-5000)
Escola G,Particular,1858,"$1,081,356.00",$582.00,83.975780,83.061895,97.039828,94.133477,91.334769,<$585,Midsize (1000-2000)
Escola H,Publica,4976,"$3,124,928.00",$628.00,81.033963,77.048432,81.933280,66.680064,54.642283,$585-630,Large (2000-5000)
Escola I,Particular,427,"$248,087.00",$581.00,83.814988,83.803279,96.252927,92.505855,89.227166,<$585,Small Size (<1000)
Escola J,Particular,962,"$585,858.00",$609.00,84.044699,83.839917,95.945946,94.594595,90.540541,$585-630,Small Size (<1000)
Escola K,Particular,1800,"$1,049,400.00",$583.00,83.955000,83.682222,96.611111,93.333333,90.333333,<$585,Midsize (1000-2000)
Escola L,Publica,3999,"$2,547,363.00",$637.00,80.744686,76.842711,80.220055,66.366592,52.988247,$630-645,Large (2000-5000)
Escola M,Publica,4761,"$3,094,650.00",$650.00,80.966394,77.072464,81.222432,66.057551,53.539172,$645-680,Large (2000-5000)
Escola N,Publica,2739,"$1,763,916.00",$644.00,80.746258,77.102592,79.299014,68.309602,54.289887,$630-645,Large (2000-5000)
Escola O,Particular,1625,"$1,043,130.00",$641.93,83.810462,83.435077,97.292308,93.230769,90.892308,$630-645,Midsize (1000-2000)

In [75]:
df_14_1 = school_performance_summary_df.groupby(["School Size"])["Average Grade Approval Writing"].agg('mean')
df_14_2 = school_performance_summary_df.groupby(["School Size"])["Average Mathematics Approval Grade"].agg('mean')
df_14_3 = school_performance_summary_df.groupby(["School Size"])["% Approved Writing"].agg('mean')
df_14_4 = school_performance_summary_df.groupby(["School Size"])["% Approved Mathematics"].agg('mean')
df_14_5 = school_performance_summary_df.groupby(["School Size"])["% General Approved"].agg('mean')

In [76]:
performance_size_df = pd.DataFrame({"Average Writing" : df_14_1.round(2),
                                      "Average Mathematics": df_14_2.round(2),
                                      "% Approved Writing": df_14_3.round(2),
                                      "% Approved Mathematics": df_14_4.round(2),
                                      "% General Approved": df_14_5.round(2)})

In [77]:
performance_size_df

,Average Writing,Average Mathematics,% Approved Writing,% Approved Mathematics,% General Approved
School Size,,,,,
Small Size (<1000),83.93,83.82,96.10,93.55,89.88
Midsize (1000-2000),83.86,83.38,96.79,93.59,90.61
Large (2000-5000),81.34,77.75,82.77,69.96,58.29

> **15- What is the impact of the type of school on student performance?**

In [78]:
school_performance_summary_df.columns

Index(['School Type', 'Total Students', 'Total Budget', 'Budget Per Student',
       'Average Grade Approval Writing', 'Average Mathematics Approval Grade',
       '% Approved Writing', '% Approved Mathematics', '% General Approved',
       'Spending Range Per Student', 'School Size'],
      dtype='object')

In [79]:
df_15_1 = school_performance_summary_df.groupby(["School Type"])["Average Grade Approval Writing"].agg('mean')
df_15_2 = school_performance_summary_df.groupby(["School Type"])["Average Mathematics Approval Grade"].agg('mean')
df_15_3 = school_performance_summary_df.groupby(["School Type"])["% Approved Writing"].agg('mean')
df_15_4 = school_performance_summary_df.groupby(["School Type"])["% Approved Mathematics"].agg('mean')
df_15_5 = school_performance_summary_df.groupby(["School Type"])["% General Approved"].agg('mean')

In [80]:
school_type_performance = pd.DataFrame({"Average Writing" : df_15_1.round(2),
                                      "Average Mathematics": df_15_2.round(2),
                                      "% Approved Writing": df_15_3.round(2),
                                      "% Approved Mathematics": df_15_4.round(2),
                                      "% General Approved": df_15_5.round(2)})

In [81]:
school_type_performance

,Average Writing,Average Mathematics,% Approved Writing,% Approved Mathematics,% General Approved
School Type,,,,,
Particular,83.89,83.48,96.58,93.62,90.43
Publica,80.97,76.96,80.80,66.55,53.67

In [82]:
school_performance_summary_df.to_excel('dataset/df_resumo_performance_escolar.xlsx')